__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_image (InputLayer)        (None, None, None, 4 0
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, None, None, 4 0           input_image[0][0]
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, None, None, 6 12608       zero_padding2d_1[0][0]
__________________________________________________________________________________________________
bn_conv1 (BatchNorm)            (None, None, None, 6 256         conv1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, None, 6 0           bn_conv1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 6 0           activation_1[0][0]
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, None, None, 6 4160        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
bn2a_branch2a (BatchNorm)       (None, None, None, 6 256         res2a_branch2a[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, None, 6 0           bn2a_branch2a[0][0]
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, None, None, 6 36928       activation_2[0][0]
__________________________________________________________________________________________________
bn2a_branch2b (BatchNorm)       (None, None, None, 6 256         res2a_branch2b[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, None, 6 0           bn2a_branch2b[0][0]
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, None, None, 2 16640       activation_3[0][0]
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, None, None, 2 16640       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
bn2a_branch2c (BatchNorm)       (None, None, None, 2 1024        res2a_branch2c[0][0]
__________________________________________________________________________________________________
bn2a_branch1 (BatchNorm)        (None, None, None, 2 1024        res2a_branch1[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, None, 2 0           bn2a_branch2c[0][0]
                                                                 bn2a_branch1[0][0]
__________________________________________________________________________________________________
res2a_out (Activation)          (None, None, None, 2 0           add_1[0][0]
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, None, None, 6 16448       res2a_out[0][0]
__________________________________________________________________________________________________
bn2b_branch2a (BatchNorm)       (None, None, None, 6 256         res2b_branch2a[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, None, 6 0           bn2b_branch2a[0][0]
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, None, None, 6 36928       activation_4[0][0]
__________________________________________________________________________________________________
bn2b_branch2b (BatchNorm)       (None, None, None, 6 256         res2b_branch2b[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, None, 6 0           bn2b_branch2b[0][0]
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, None, None, 2 16640       activation_5[0][0]
__________________________________________________________________________________________________
bn2b_branch2c (BatchNorm)       (None, None, None, 2 1024        res2b_branch2c[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, None, 2 0           bn2b_branch2c[0][0]
                                                                 res2a_out[0][0]
__________________________________________________________________________________________________
res2b_out (Activation)          (None, None, None, 2 0           add_2[0][0]
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, None, None, 6 16448       res2b_out[0][0]
__________________________________________________________________________________________________
bn2c_branch2a (BatchNorm)       (None, None, None, 6 256         res2c_branch2a[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, None, 6 0           bn2c_branch2a[0][0]
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, None, None, 6 36928       activation_6[0][0]
__________________________________________________________________________________________________
bn2c_branch2b (BatchNorm)       (None, None, None, 6 256         res2c_branch2b[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, None, 6 0           bn2c_branch2b[0][0]
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, None, None, 2 16640       activation_7[0][0]
__________________________________________________________________________________________________
bn2c_branch2c (BatchNorm)       (None, None, None, 2 1024        res2c_branch2c[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, None, 2 0           bn2c_branch2c[0][0]
                                                                 res2b_out[0][0]
__________________________________________________________________________________________________
res2c_out (Activation)          (None, None, None, 2 0           add_3[0][0]
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, None, None, 1 32896       res2c_out[0][0]
__________________________________________________________________________________________________
bn3a_branch2a (BatchNorm)       (None, None, None, 1 512         res3a_branch2a[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, None, 1 0           bn3a_branch2a[0][0]
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, None, None, 1 147584      activation_8[0][0]
__________________________________________________________________________________________________
bn3a_branch2b (BatchNorm)       (None, None, None, 1 512         res3a_branch2b[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, None, 1 0           bn3a_branch2b[0][0]
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, None, None, 5 66048       activation_9[0][0]
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, None, None, 5 131584      res2c_out[0][0]
__________________________________________________________________________________________________
bn3a_branch2c (BatchNorm)       (None, None, None, 5 2048        res3a_branch2c[0][0]
__________________________________________________________________________________________________
bn3a_branch1 (BatchNorm)        (None, None, None, 5 2048        res3a_branch1[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, None, 5 0           bn3a_branch2c[0][0]
                                                                 bn3a_branch1[0][0]
__________________________________________________________________________________________________
res3a_out (Activation)          (None, None, None, 5 0           add_4[0][0]
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, None, None, 1 65664       res3a_out[0][0]
__________________________________________________________________________________________________
bn3b_branch2a (BatchNorm)       (None, None, None, 1 512         res3b_branch2a[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, None, 1 0           bn3b_branch2a[0][0]
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, None, None, 1 147584      activation_10[0][0]
__________________________________________________________________________________________________
bn3b_branch2b (BatchNorm)       (None, None, None, 1 512         res3b_branch2b[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, None, 1 0           bn3b_branch2b[0][0]
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, None, None, 5 66048       activation_11[0][0]
__________________________________________________________________________________________________
bn3b_branch2c (BatchNorm)       (None, None, None, 5 2048        res3b_branch2c[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, None, 5 0           bn3b_branch2c[0][0]
                                                                 res3a_out[0][0]
__________________________________________________________________________________________________
res3b_out (Activation)          (None, None, None, 5 0           add_5[0][0]
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, None, None, 1 65664       res3b_out[0][0]
__________________________________________________________________________________________________
bn3c_branch2a (BatchNorm)       (None, None, None, 1 512         res3c_branch2a[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, None, 1 0           bn3c_branch2a[0][0]
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, None, None, 1 147584      activation_12[0][0]
__________________________________________________________________________________________________
bn3c_branch2b (BatchNorm)       (None, None, None, 1 512         res3c_branch2b[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, None, 1 0           bn3c_branch2b[0][0]
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, None, None, 5 66048       activation_13[0][0]
__________________________________________________________________________________________________
bn3c_branch2c (BatchNorm)       (None, None, None, 5 2048        res3c_branch2c[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, None, 5 0           bn3c_branch2c[0][0]
                                                                 res3b_out[0][0]
__________________________________________________________________________________________________
res3c_out (Activation)          (None, None, None, 5 0           add_6[0][0]
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, None, None, 1 65664       res3c_out[0][0]
__________________________________________________________________________________________________
bn3d_branch2a (BatchNorm)       (None, None, None, 1 512         res3d_branch2a[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, None, 1 0           bn3d_branch2a[0][0]
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, None, None, 1 147584      activation_14[0][0]
__________________________________________________________________________________________________
bn3d_branch2b (BatchNorm)       (None, None, None, 1 512         res3d_branch2b[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, None, 1 0           bn3d_branch2b[0][0]
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, None, None, 5 66048       activation_15[0][0]
__________________________________________________________________________________________________
bn3d_branch2c (BatchNorm)       (None, None, None, 5 2048        res3d_branch2c[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, None, 5 0           bn3d_branch2c[0][0]
                                                                 res3c_out[0][0]
__________________________________________________________________________________________________
res3d_out (Activation)          (None, None, None, 5 0           add_7[0][0]
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, None, None, 2 131328      res3d_out[0][0]
__________________________________________________________________________________________________
bn4a_branch2a (BatchNorm)       (None, None, None, 2 1024        res4a_branch2a[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, None, 2 0           bn4a_branch2a[0][0]
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, None, None, 2 590080      activation_16[0][0]
__________________________________________________________________________________________________
bn4a_branch2b (BatchNorm)       (None, None, None, 2 1024        res4a_branch2b[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, None, 2 0           bn4a_branch2b[0][0]
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, None, None, 1 263168      activation_17[0][0]
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, None, None, 1 525312      res3d_out[0][0]
__________________________________________________________________________________________________
bn4a_branch2c (BatchNorm)       (None, None, None, 1 4096        res4a_branch2c[0][0]
__________________________________________________________________________________________________
bn4a_branch1 (BatchNorm)        (None, None, None, 1 4096        res4a_branch1[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, None, 1 0           bn4a_branch2c[0][0]
                                                                 bn4a_branch1[0][0]
__________________________________________________________________________________________________
res4a_out (Activation)          (None, None, None, 1 0           add_8[0][0]
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, None, None, 2 262400      res4a_out[0][0]
__________________________________________________________________________________________________
bn4b_branch2a (BatchNorm)       (None, None, None, 2 1024        res4b_branch2a[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, None, 2 0           bn4b_branch2a[0][0]
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, None, None, 2 590080      activation_18[0][0]
__________________________________________________________________________________________________
bn4b_branch2b (BatchNorm)       (None, None, None, 2 1024        res4b_branch2b[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, None, 2 0           bn4b_branch2b[0][0]
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, None, None, 1 263168      activation_19[0][0]
__________________________________________________________________________________________________
bn4b_branch2c (BatchNorm)       (None, None, None, 1 4096        res4b_branch2c[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, None, 1 0           bn4b_branch2c[0][0]
                                                                 res4a_out[0][0]
__________________________________________________________________________________________________
res4b_out (Activation)          (None, None, None, 1 0           add_9[0][0]
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, None, None, 2 262400      res4b_out[0][0]
__________________________________________________________________________________________________
bn4c_branch2a (BatchNorm)       (None, None, None, 2 1024        res4c_branch2a[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, None, 2 0           bn4c_branch2a[0][0]
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, None, None, 2 590080      activation_20[0][0]
__________________________________________________________________________________________________
bn4c_branch2b (BatchNorm)       (None, None, None, 2 1024        res4c_branch2b[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, None, 2 0           bn4c_branch2b[0][0]
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, None, None, 1 263168      activation_21[0][0]
__________________________________________________________________________________________________
bn4c_branch2c (BatchNorm)       (None, None, None, 1 4096        res4c_branch2c[0][0]
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, None, 1 0           bn4c_branch2c[0][0]
                                                                 res4b_out[0][0]
__________________________________________________________________________________________________
res4c_out (Activation)          (None, None, None, 1 0           add_10[0][0]
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, None, None, 2 262400      res4c_out[0][0]
__________________________________________________________________________________________________
bn4d_branch2a (BatchNorm)       (None, None, None, 2 1024        res4d_branch2a[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, None, 2 0           bn4d_branch2a[0][0]
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, None, None, 2 590080      activation_22[0][0]
__________________________________________________________________________________________________
bn4d_branch2b (BatchNorm)       (None, None, None, 2 1024        res4d_branch2b[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, None, 2 0           bn4d_branch2b[0][0]
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, None, None, 1 263168      activation_23[0][0]
__________________________________________________________________________________________________
bn4d_branch2c (BatchNorm)       (None, None, None, 1 4096        res4d_branch2c[0][0]
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, None, 1 0           bn4d_branch2c[0][0]
                                                                 res4c_out[0][0]
__________________________________________________________________________________________________
res4d_out (Activation)          (None, None, None, 1 0           add_11[0][0]
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, None, None, 2 262400      res4d_out[0][0]
__________________________________________________________________________________________________
bn4e_branch2a (BatchNorm)       (None, None, None, 2 1024        res4e_branch2a[0][0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, None, 2 0           bn4e_branch2a[0][0]
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, None, None, 2 590080      activation_24[0][0]
__________________________________________________________________________________________________
bn4e_branch2b (BatchNorm)       (None, None, None, 2 1024        res4e_branch2b[0][0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, None, 2 0           bn4e_branch2b[0][0]
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, None, None, 1 263168      activation_25[0][0]
__________________________________________________________________________________________________
bn4e_branch2c (BatchNorm)       (None, None, None, 1 4096        res4e_branch2c[0][0]
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, None, 1 0           bn4e_branch2c[0][0]
                                                                 res4d_out[0][0]
__________________________________________________________________________________________________
res4e_out (Activation)          (None, None, None, 1 0           add_12[0][0]
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, None, None, 2 262400      res4e_out[0][0]
__________________________________________________________________________________________________
bn4f_branch2a (BatchNorm)       (None, None, None, 2 1024        res4f_branch2a[0][0]
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, None, 2 0           bn4f_branch2a[0][0]
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, None, None, 2 590080      activation_26[0][0]
__________________________________________________________________________________________________
bn4f_branch2b (BatchNorm)       (None, None, None, 2 1024        res4f_branch2b[0][0]
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, None, 2 0           bn4f_branch2b[0][0]
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, None, None, 1 263168      activation_27[0][0]
__________________________________________________________________________________________________
bn4f_branch2c (BatchNorm)       (None, None, None, 1 4096        res4f_branch2c[0][0]
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, None, 1 0           bn4f_branch2c[0][0]
                                                                 res4e_out[0][0]
__________________________________________________________________________________________________
res4f_out (Activation)          (None, None, None, 1 0           add_13[0][0]
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, None, None, 5 524800      res4f_out[0][0]
__________________________________________________________________________________________________
bn5a_branch2a (BatchNorm)       (None, None, None, 5 2048        res5a_branch2a[0][0]
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, None, 5 0           bn5a_branch2a[0][0]
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, None, None, 5 2359808     activation_28[0][0]
__________________________________________________________________________________________________
bn5a_branch2b (BatchNorm)       (None, None, None, 5 2048        res5a_branch2b[0][0]
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, None, 5 0           bn5a_branch2b[0][0]
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, None, None, 2 1050624     activation_29[0][0]
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, None, None, 2 2099200     res4f_out[0][0]
__________________________________________________________________________________________________
bn5a_branch2c (BatchNorm)       (None, None, None, 2 8192        res5a_branch2c[0][0]
__________________________________________________________________________________________________
bn5a_branch1 (BatchNorm)        (None, None, None, 2 8192        res5a_branch1[0][0]
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, None, 2 0           bn5a_branch2c[0][0]
                                                                 bn5a_branch1[0][0]
__________________________________________________________________________________________________
res5a_out (Activation)          (None, None, None, 2 0           add_14[0][0]
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, None, None, 5 1049088     res5a_out[0][0]
__________________________________________________________________________________________________
bn5b_branch2a (BatchNorm)       (None, None, None, 5 2048        res5b_branch2a[0][0]
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, None, 5 0           bn5b_branch2a[0][0]
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, None, None, 5 2359808     activation_30[0][0]
__________________________________________________________________________________________________
bn5b_branch2b (BatchNorm)       (None, None, None, 5 2048        res5b_branch2b[0][0]
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, None, 5 0           bn5b_branch2b[0][0]
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, None, None, 2 1050624     activation_31[0][0]
__________________________________________________________________________________________________
bn5b_branch2c (BatchNorm)       (None, None, None, 2 8192        res5b_branch2c[0][0]
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, None, 2 0           bn5b_branch2c[0][0]
                                                                 res5a_out[0][0]
__________________________________________________________________________________________________
res5b_out (Activation)          (None, None, None, 2 0           add_15[0][0]
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, None, None, 5 1049088     res5b_out[0][0]
__________________________________________________________________________________________________
bn5c_branch2a (BatchNorm)       (None, None, None, 5 2048        res5c_branch2a[0][0]
__________________________________________________________________________________________________
activation_32 (Activation)      (None, None, None, 5 0           bn5c_branch2a[0][0]
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, None, None, 5 2359808     activation_32[0][0]
__________________________________________________________________________________________________
bn5c_branch2b (BatchNorm)       (None, None, None, 5 2048        res5c_branch2b[0][0]
__________________________________________________________________________________________________
activation_33 (Activation)      (None, None, None, 5 0           bn5c_branch2b[0][0]
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, None, None, 2 1050624     activation_33[0][0]
__________________________________________________________________________________________________
bn5c_branch2c (BatchNorm)       (None, None, None, 2 8192        res5c_branch2c[0][0]
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, None, 2 0           bn5c_branch2c[0][0]
                                                                 res5b_out[0][0]
__________________________________________________________________________________________________
res5c_out (Activation)          (None, None, None, 2 0           add_16[0][0]
__________________________________________________________________________________________________
fpn_c5p5 (Conv2D)               (None, None, None, 2 524544      res5c_out[0][0]
__________________________________________________________________________________________________
fpn_p5upsampled (UpSampling2D)  (None, None, None, 2 0           fpn_c5p5[0][0]
__________________________________________________________________________________________________
fpn_c4p4 (Conv2D)               (None, None, None, 2 262400      res4f_out[0][0]
__________________________________________________________________________________________________
fpn_p4add (Add)                 (None, None, None, 2 0           fpn_p5upsampled[0][0]
                                                                 fpn_c4p4[0][0]
__________________________________________________________________________________________________
fpn_p4upsampled (UpSampling2D)  (None, None, None, 2 0           fpn_p4add[0][0]
__________________________________________________________________________________________________
fpn_c3p3 (Conv2D)               (None, None, None, 2 131328      res3d_out[0][0]
__________________________________________________________________________________________________
fpn_p3add (Add)                 (None, None, None, 2 0           fpn_p4upsampled[0][0]
                                                                 fpn_c3p3[0][0]
__________________________________________________________________________________________________
fpn_p3upsampled (UpSampling2D)  (None, None, None, 2 0           fpn_p3add[0][0]
__________________________________________________________________________________________________
fpn_c2p2 (Conv2D)               (None, None, None, 2 65792       res2c_out[0][0]
__________________________________________________________________________________________________
fpn_p2add (Add)                 (None, None, None, 2 0           fpn_p3upsampled[0][0]
                                                                 fpn_c2p2[0][0]
__________________________________________________________________________________________________
fpn_p5 (Conv2D)                 (None, None, None, 2 590080      fpn_c5p5[0][0]
__________________________________________________________________________________________________
fpn_p2 (Conv2D)                 (None, None, None, 2 590080      fpn_p2add[0][0]
__________________________________________________________________________________________________
fpn_p3 (Conv2D)                 (None, None, None, 2 590080      fpn_p3add[0][0]
__________________________________________________________________________________________________
fpn_p4 (Conv2D)                 (None, None, None, 2 590080      fpn_p4add[0][0]
__________________________________________________________________________________________________
fpn_p6 (MaxPooling2D)           (None, None, None, 2 0           fpn_p5[0][0]
__________________________________________________________________________________________________
rpn_model (Model)               [(None, None, 2), (N 1189394     fpn_p2[0][0]
                                                                 fpn_p3[0][0]
                                                                 fpn_p4[0][0]
                                                                 fpn_p5[0][0]
                                                                 fpn_p6[0][0]
__________________________________________________________________________________________________
rpn_class (Concatenate)         (None, None, 2)      0           rpn_model[1][1]
                                                                 rpn_model[2][1]
                                                                 rpn_model[3][1]
                                                                 rpn_model[4][1]
                                                                 rpn_model[5][1]
__________________________________________________________________________________________________
rpn_bbox (Concatenate)          (None, None, 4)      0           rpn_model[1][2]
                                                                 rpn_model[2][2]
                                                                 rpn_model[3][2]
                                                                 rpn_model[4][2]
                                                                 rpn_model[5][2]
__________________________________________________________________________________________________
anchors (Lambda)                (1, 36828, 4)        0           input_image[0][0]
__________________________________________________________________________________________________
input_gt_boxes (InputLayer)     (None, None, 4)      0
__________________________________________________________________________________________________
ROI (ProposalLayer)             (None, 2000, 4)      0           rpn_class[0][0]
                                                                 rpn_bbox[0][0]
                                                                 anchors[0][0]
__________________________________________________________________________________________________
input_gt_class_ids (InputLayer) (None, None)         0
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, 4)      0           input_gt_boxes[0][0]
__________________________________________________________________________________________________
input_gt_masks (InputLayer)     (None, 56, 56, None) 0
__________________________________________________________________________________________________
proposal_targets (DetectionTarg [(None, 200, 4), (No 0           ROI[0][0]
                                                                 input_gt_class_ids[0][0]
                                                                 lambda_1[0][0]
                                                                 input_gt_masks[0][0]
__________________________________________________________________________________________________
input_image_meta (InputLayer)   (None, 14)           0
__________________________________________________________________________________________________
roi_align_mask (PyramidROIAlign (None, 200, 14, 14,  0           proposal_targets[0][0]
                                                                 input_image_meta[0][0]
                                                                 fpn_p2[0][0]
                                                                 fpn_p3[0][0]
                                                                 fpn_p4[0][0]
                                                                 fpn_p5[0][0]
__________________________________________________________________________________________________
mrcnn_mask_conv1 (TimeDistribut (None, 200, 14, 14,  590080      roi_align_mask[0][0]
__________________________________________________________________________________________________
mrcnn_mask_bn1 (TimeDistributed (None, 200, 14, 14,  1024        mrcnn_mask_conv1[0][0]
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 200, 14, 14,  0           mrcnn_mask_bn1[0][0]
__________________________________________________________________________________________________
mrcnn_mask_conv2 (TimeDistribut (None, 200, 14, 14,  590080      activation_37[0][0]
__________________________________________________________________________________________________
roi_align_classifier (PyramidRO (None, 200, 7, 7, 25 0           proposal_targets[0][0]
                                                                 input_image_meta[0][0]
                                                                 fpn_p2[0][0]
                                                                 fpn_p3[0][0]
                                                                 fpn_p4[0][0]
                                                                 fpn_p5[0][0]
__________________________________________________________________________________________________
mrcnn_mask_bn2 (TimeDistributed (None, 200, 14, 14,  1024        mrcnn_mask_conv2[0][0]
__________________________________________________________________________________________________
mrcnn_class_conv1 (TimeDistribu (None, 200, 1, 1, 10 12846080    roi_align_classifier[0][0]
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 200, 14, 14,  0           mrcnn_mask_bn2[0][0]
__________________________________________________________________________________________________
mrcnn_class_bn1 (TimeDistribute (None, 200, 1, 1, 10 4096        mrcnn_class_conv1[0][0]
__________________________________________________________________________________________________
mrcnn_mask_conv3 (TimeDistribut (None, 200, 14, 14,  590080      activation_38[0][0]
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 200, 1, 1, 10 0           mrcnn_class_bn1[0][0]
__________________________________________________________________________________________________
mrcnn_mask_bn3 (TimeDistributed (None, 200, 14, 14,  1024        mrcnn_mask_conv3[0][0]
__________________________________________________________________________________________________
mrcnn_class_conv2 (TimeDistribu (None, 200, 1, 1, 10 1049600     activation_34[0][0]
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 200, 14, 14,  0           mrcnn_mask_bn3[0][0]
__________________________________________________________________________________________________
mrcnn_class_bn2 (TimeDistribute (None, 200, 1, 1, 10 4096        mrcnn_class_conv2[0][0]
__________________________________________________________________________________________________
mrcnn_mask_conv4 (TimeDistribut (None, 200, 14, 14,  590080      activation_39[0][0]
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 200, 1, 1, 10 0           mrcnn_class_bn2[0][0]
__________________________________________________________________________________________________
mrcnn_mask_bn4 (TimeDistributed (None, 200, 14, 14,  1024        mrcnn_mask_conv4[0][0]
__________________________________________________________________________________________________
pool_squeeze (Lambda)           (None, 200, 1024)    0           activation_35[0][0]
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 200, 14, 14,  0           mrcnn_mask_bn4[0][0]
__________________________________________________________________________________________________
mrcnn_bbox_fc (TimeDistributed) (None, 200, 8)       8200        pool_squeeze[0][0]
__________________________________________________________________________________________________
mrcnn_mask_deconv (TimeDistribu (None, 200, 28, 28,  262400      activation_40[0][0]
__________________________________________________________________________________________________
rpn_class_logits (Concatenate)  (None, None, 2)      0           rpn_model[1][0]
                                                                 rpn_model[2][0]
                                                                 rpn_model[3][0]
                                                                 rpn_model[4][0]
                                                                 rpn_model[5][0]
__________________________________________________________________________________________________
mrcnn_class_logits (TimeDistrib (None, 200, 2)       2050        pool_squeeze[0][0]
__________________________________________________________________________________________________
mrcnn_bbox (Reshape)            (None, 200, 2, 4)    0           mrcnn_bbox_fc[0][0]
__________________________________________________________________________________________________
mrcnn_mask (TimeDistributed)    (None, 200, 28, 28,  514         mrcnn_mask_deconv[0][0]
__________________________________________________________________________________________________
input_rpn_match (InputLayer)    (None, None, 1)      0
__________________________________________________________________________________________________
input_rpn_bbox (InputLayer)     (None, None, 4)      0
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 2)            0           input_image_meta[0][0]
__________________________________________________________________________________________________
mrcnn_class (TimeDistributed)   (None, 200, 2)       0           mrcnn_class_logits[0][0]
__________________________________________________________________________________________________
output_rois (Lambda)            (None, 200, 4)       0           proposal_targets[0][0]
__________________________________________________________________________________________________
rpn_class_loss (Lambda)         ()                   0           input_rpn_match[0][0]
                                                                 rpn_class_logits[0][0]
__________________________________________________________________________________________________
rpn_bbox_loss (Lambda)          ()                   0           input_rpn_bbox[0][0]
                                                                 input_rpn_match[0][0]
                                                                 rpn_bbox[0][0]
__________________________________________________________________________________________________
mrcnn_class_loss (Lambda)       ()                   0           proposal_targets[0][1]
                                                                 mrcnn_class_logits[0][0]
                                                                 lambda_4[0][0]
__________________________________________________________________________________________________
mrcnn_bbox_loss (Lambda)        ()                   0           proposal_targets[0][2]
                                                                 proposal_targets[0][1]
                                                                 mrcnn_bbox[0][0]
__________________________________________________________________________________________________
mrcnn_mask_loss (Lambda)        ()                   0           proposal_targets[0][3]
                                                                 proposal_targets[0][1]
                                                                 mrcnn_mask[0][0]
==================================================================================================
Total params: 44,666,078
Trainable params: 44,606,814
Non-trainable params: 59,264
__________________________________________________________________________________________________
